Mock.mock('http://localhost:1111/t',


{
  number:[ // 各省份对应的 销量
    { name: '北京', 'value|1-2000': 100 },
    { name: '天津', 'value|1-2000': 100 },
    { name: '上海', 'value|1-2000': 100 },
    { name: '重庆', 'value|1-2000': 100 },
    { name: '河北', 'value|1-2000': 100 },
    { name: '河南', 'value|1-2000': 100 },
    { name: '云南', 'value|1-2000': 100 },
    { name: '辽宁', 'value|1-2000': 100 },
    { name: '黑龙江', 'value|1-2000': 100 },
    { name: '湖南', 'value|1-2000': 100 },
    { name: '安徽', 'value|1-2000': 100 },
    { name: '山东', 'value|1-2000': 100 },
    { name: '新疆', 'value|1-2000': 100 },
    { name: '江苏', 'value|1-2000': 100 },
    { name: '浙江', 'value|1-2000': 100 },
    { name: '江西', 'value|1-2000': 100 },
    { name: '湖北', 'value|1-2000': 100 },
    { name: '广西', 'value|1-2000': 100 },
    { name: '甘肃', 'value|1-2000': 100 },
    { name: '山西', 'value|1-2000': 100 },
    { name: '内蒙古', 'value|1-2000': 100 },
    { name: '陕西', 'value|1-2000': 100 },
    { name: '吉林', 'value|1-2000': 100 },
    { name: '福建', 'value|1-2000': 100 },
    { name: '贵州', 'value|1-2000': 100 },
    { name: '广东', 'value|1-2000': 100 },
    { name: '青海', 'value|1-2000': 100 },
    { name: '西藏', 'value|1-2000': 100 },
    { name: '四川', 'value|1-2000': 100 },
    { name: '宁夏', 'value|1-2000': 100 },
    { name: '海南', 'value|1-2000': 100 },
    { name: '台湾', 'value|1-2000': 100 },
    { name: '香港', 'value|1-2000': 100 },
    { name: '澳门', 'value|1-2000': 100 }
  ],
  markPoint:[
    {
      name: '某个坐标',
      coord: '[115.892151, 27.676493]',
      'value|1-2000': 100
    },
    {
      name: '某个坐标',
      coord: '[104.066143, 30.573095]',
      'value|1-2000': 100
    }
  ]
  })